Documents/Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Закупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АктЗапасы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Закупки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗакупкаКоличествоПриИзменении(Элемент)
	ТаблицаЗакупка=Элементы.Закупка.ТекущиеДанные;
	ТаблицаЗакупка.Сумма=ТаблицаЗакупка.Количество*ТаблицаЗакупка.ЦенаЗаЕд;
	Объект.ИтоговаяСумма = Объект.Закупка.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ЗакупкаСуммаПриИзменении(Элемент)
	ТаблицаЗакупка=Элементы.Закупка.ТекущиеДанные;
	ТаблицаЗакупка.Сумма=ТаблицаЗакупка.Количество*ТаблицаЗакупка.ЦенаЗаЕд;
	Объект.ИтоговаяСумма = Объект.Закупка.Итог("Сумма")
КонецПроцедуры

&НаКлиенте
Процедура ЗакупкаЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаЗакупка=Элементы.Закупка.ТекущиеДанные;
	ТаблицаЗакупка.Сумма=ТаблицаЗакупка.Количество*ТаблицаЗакупка.ЦенаЗаЕд;
	Объект.ИтоговаяСумма = Объект.Закупка.Итог("Сумма")
КонецПроцедуры


&НаКлиенте
Процедура ЗакупкаПриИзменении(Элемент)
	Объект.ИтоговаяСумма = Объект.Закупка.Итог("Сумма")
КонецПроцедуры
